/*
This file is part of Telegram Desktop,
the official desktop version of Telegram messaging app, see https://telegram.org

Telegram Desktop is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

It is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
GNU General Public License for more details.

In addition, as a special exception, the copyright holders give permission
to link the code of portions of this program with the OpenSSL library.

Full license: https://github.com/telegramdesktop/tdesktop/blob/master/LICENSE
Copyright (c) 2014-2017 John Preston, https://desktop.telegram.org
*/
"lng_language_name" = "Français";
"lng_switch_to_this" = "Passer en français";

"lng_menu_contacts" = "Contacts";
"lng_menu_calls" = "Appels";
"lng_menu_settings" = "Paramètres";
"lng_menu_about" = "À propos";
"lng_menu_update" = "Mettre à jour";
"lng_menu_restart" = "Relancer";
"lng_menu_back" = "Retour";
"lng_menu_night_mode" = "Mode nuit";

"lng_disable_notifications_from_tray" = "Désactiver les notifications";
"lng_enable_notifications_from_tray" = "Activer les notifications";
"lng_open_from_tray" = "Ouvrir Telegram";
"lng_minimize_to_tray" = "Minimiser vers la barre";
"lng_quit_from_tray" = "Quitter Telegram";
"lng_tray_icon_text" = "Telegram fonctionne toujours ici,\nvous pouvez changer ceci dans les paramètres.\nSi l'icône disparait de ce menu,\nvous pouvez la glisser depuis les icônes cachées.";

"lng_month1" = "Janvier";
"lng_month2" = "Février";
"lng_month3" = "Mars";
"lng_month4" = "Avril";
"lng_month5" = "Mai";
"lng_month6" = "Juin";
"lng_month7" = "Juillet";
"lng_month8" = "Août";
"lng_month9" = "Septembre";
"lng_month10" = "Octobre";
"lng_month11" = "Novembre";
"lng_month12" = "Décembre";

"lng_month1_small" = "Jan";
"lng_month2_small" = "Fév";
"lng_month3_small" = "Mar";
"lng_month4_small" = "Avr";
"lng_month5_small" = "Mai";
"lng_month6_small" = "Jun";
"lng_month7_small" = "Jul";
"lng_month8_small" = "Aou";
"lng_month9_small" = "Sep";
"lng_month10_small" = "Oct";
"lng_month11_small" = "Nov";
"lng_month12_small" = "Déc";

"lng_weekday1" = "Lun";
"lng_weekday2" = "Mar";
"lng_weekday3" = "Mer";
"lng_weekday4" = "Jeu";
"lng_weekday5" = "Ven";
"lng_weekday6" = "Sam";
"lng_weekday7" = "Dim";

"lng_weekday1_full" = "Lundi";
"lng_weekday2_full" = "Mardi";
"lng_weekday3_full" = "Mercredi";
"lng_weekday4_full" = "Jeudi";
"lng_weekday5_full" = "Vendredi";
"lng_weekday6_full" = "Samedi";
"lng_weekday7_full" = "Dimanche";

"lng_month_day" = "{day} {month}";
"lng_month_day_year" = "{day} {month} {year}";
"lng_month_year" = "{month} {year}";

"lng_box_ok" = "OK";

"lng_cancel" = "Annuler";
"lng_continue" = "Continuer";
"lng_close" = "Fermer";
"lng_connecting" = "Connexion...";
"lng_connecting_to_proxy" = "Connexion au proxy...";
"lng_connecting_settings" = "Paramètres";
"lng_reconnecting#one" = "Reconnexion dans {count}s...";
"lng_reconnecting#other" = "Reconnexion dans {count}s...";
"lng_reconnecting_try_now" = "Réessayer maintenant";

"lng_status_service_notifications" = "notifications de service";
"lng_status_support" = "support";
"lng_status_bot" = "bot";
"lng_status_bot_reads_all" = "a accès aux messages";
"lng_status_bot_not_reads_all" = "n'a pas accès aux messages";
"lng_status_offline" = "vu il y a longtemps";
"lng_status_recently" = "vu récemment";
"lng_status_last_week" = "vu cette semaine";
"lng_status_last_month" = "vu ce mois-ci";
"lng_status_invisible" = "invisible";
"lng_status_lastseen_now" = "vu à l'instant";
"lng_status_lastseen_minutes#one" = "vu il y a {count} minute";
"lng_status_lastseen_minutes#other" = "vu il y a {count} minutes";
"lng_status_lastseen_hours#one" = "vu il y a {count} heure";
"lng_status_lastseen_hours#other" = "vu il y a {count} heures";
"lng_status_lastseen_today" = "vu aujourd'hui à {time}";
"lng_status_lastseen_yesterday" = "vu hier à {time}";
"lng_status_lastseen_date" = "vu le {date}";
"lng_status_lastseen_date_time" = "vu le {date} à {time}";
"lng_status_online" = "en ligne";
"lng_status_connecting" = "connexion...";

"lng_chat_status_unaccessible" = "groupe inaccessible";
"lng_chat_status_no_members" = "aucun membre";
"lng_chat_status_members#one" = "{count} membre";
"lng_chat_status_members#other" = "{count} membres";
"lng_chat_status_online#one" = "{count} en ligne";
"lng_chat_status_online#other" = "{count} en ligne";
"lng_chat_status_members_online" = "{members_count}, {online_count}";

"lng_channel_status" = "chaines";
"lng_group_status" = "groupes";

"lng_channel_members_link#one" = "{count} membre";
"lng_channel_members_link#other" = "{count} membres";
"lng_channel_admins_link#one" = "{count} administrateur";
"lng_channel_admins_link#other" = "{count} administrateurs";

"lng_server_error" = "Erreur interne au serveur.";
"lng_flood_error" = "Trop d'essais. Veuillez réessayer plus tard.";
"lng_gif_error" = "An error has occured while reading GIF animation :(";
"lng_edit_error" = "You cannot edit this message";
"lng_join_channel_error" = "Sorry, you have joined too many channels and supergroups. Please leave some before joining.";
"lng_error_phone_flood" = "Sorry, you have deleted and re-created your account too many times recently. Please wait for a few days before signing up again.";
"lng_error_start_minimized_passcoded" = "You have set a local passcode, so the app can't be launched minimized. App will ask you to enter the passcode before it can start working.";
"lng_error_pinned_max#one" = "Sorry, you can pin no more than {count} chat to the top.";
"lng_error_pinned_max#other" = "Sorry, you can pin no more than {count} chats to the top.";
"lng_error_public_groups_denied" = "Unfortunately, you were banned from participating in public groups.\n{more_info}";
"lng_error_cant_edit_admin" = "Sorry, you can't edit permissions for this admin.";
"lng_error_cant_add_member" = "Sorry, you can't add the bot to this group. Ask a group admin to do it.";
"lng_error_cant_add_admin_invite" = "Sorry, you can't add this user as an admin because they are not a member of this group and you are not allowed to invite them.";
"lng_error_cant_add_admin_unban" = "Sorry, you can't add this user as an admin because they are in the blacklist and you can't unban them.";
"lng_error_cant_ban_admin" = "Sorry, you can't ban this user because they are an admin in this group and you are not allowed to demote them.";
"lng_sure_add_admin_invite" = "This user is not a member of this group. Add them to the group and promote them to admin?";
"lng_sure_add_admin_unban" = "This user is currently restricted or banned in this group. Are you sure you want to unban and promote them?";
"lng_sure_ban_admin" = "This user is an admin in this group. Are you sure you want to go ahead and restrict them?";
"lng_sure_ban_user_group" = "Ban {user} in the group?";
"lng_sure_enable_socks" = "Are you sure you want to enable this proxy?\n\nServer: {server}\nPort: {port}\n\nYou can change your proxy server later in the Settings (Connection Type).";
"lng_sure_enable" = "Enable";

"lng_edit_deleted" = "Ce message a été supprimé";
"lng_edit_too_long" = "Votre message texte est trop long";
"lng_edit_message" = "Editer le message";
"lng_edit_message_text" = "Nouveau message texte...";
"lng_deleted" = "Compte supprimé";
"lng_deleted_message" = "Message supprimé";
"lng_pinned_message" = "Message épinglé";
"lng_pinned_unpin_sure" = "Voulez-vous désépingler ce message ?";
"lng_pinned_pin_sure" = "Voulez-vous épingler ce message ?";
"lng_pinned_pin" = "Épingler";
"lng_pinned_unpin" = "Désépingler";
"lng_pinned_notify" = "Notifier tous les membres";

"lng_intro_about" = "Bienvenue dans l'app officielle Telegram Bureau.\nC'est rapide et sécurisé.";
"lng_start_msgs" = "COMMENCER À DISCUTER";

"lng_intro_next" = "SUIVANT";
"lng_intro_finish" = "S'INSCRIRE";
"lng_intro_submit" = "ENVOYER";

"lng_photo_caption" = "Légende";
"lng_photos_comment" = "Commentaire";

"lng_phone_ph" = "Votre numéro de téléphone";
"lng_phone_title" = "Votre téléphone";
"lng_phone_desc" = "Veuillez confirmer votre indicatif et\nentrer votre numéro de téléphone.";
"lng_phone_notreg" = "If you don't have a Telegram account yet,\nplease [b]sign up[/b] with {link_start}Android / iPhone{link_end} or {signup_start}here{signup_end}";
"lng_country_code" = "Country Code";
"lng_bad_country_code" = "Invalid Country Code";
"lng_country_ph" = "Search";
"lng_country_done" = "Done";
"lng_country_none" = "Country not found";
"lng_country_select" = "Select country";

"lng_code_ph" = "Your code";
"lng_code_desc" = "We have sent you a message with activation\ncode to your phone. Please enter it below.";
"lng_code_telegram" = "Please enter the code you've just received\nin your previous [b]Telegram[/b] app.";
"lng_code_no_telegram" = "Send code via SMS";
"lng_code_call" = "Telegram will dial your number in {minutes}:{seconds}";
"lng_code_calling" = "Requesting a call from Telegram...";
"lng_code_called" = "Telegram dialed your number";

"lng_bad_phone" = "Invalid phone number. Please try again.";
"lng_bad_phone_noreg" = "Phone number not registered.";
"lng_bad_code" = "You have entered an invalid code.";
"lng_bad_name" = "Please enter your first and last name.";
"lng_bad_photo" = "Bad image selected.";

"lng_signin_title" = "Cloud password check";
"lng_signin_desc" = "Please enter your cloud password.";
"lng_signin_recover_desc" = "Please enter the code from the e-mail\n{email}";
"lng_signin_password" = "Your cloud password";
"lng_signin_code" = "Code from e-mail";
"lng_signin_recover" = "Forgot password?";
"lng_signin_recover_title" = "Password reset";
"lng_signin_hint" = "Hint: {password_hint}";
"lng_signin_recover_hint" = "Code was sent to {recover_email}";
"lng_signin_bad_password" = "You have entered a wrong password.";
"lng_signin_wrong_code" = "You have entered an invalid code.";
"lng_signin_try_password" = "Having trouble accessing your e-mail?";
"lng_signin_password_removed" = "Your cloud password was disabled.\nYou can set a new one in Settings.";
"lng_signin_no_email_forgot" = "Since you haven't provided a recovery\ne-mail when setting up your password, your remaining options are either to remember your password or to reset your account.";
"lng_signin_cant_email_forgot" = "If you can't restore access to the e-mail, your remaining options are either to remember your password or to reset your account.";
"lng_signin_reset_account" = "Reset your account";
"lng_signin_sure_reset" = "Warning!\n\nYou will lose all your chats and messages, along with any media and files you shared!\n\nDo you want to reset your account?";
"lng_signin_reset" = "Reset";
"lng_signin_reset_wait" = "Since the account {phone_number} is active and protected by a password, we will delete it in 1 week for security purposes. You can cancel this process at any time.\n\nYou’ll be able to reset your account in:\n{when}";
"lng_signin_reset_days#one" = "{count} day";
"lng_signin_reset_days#other" = "{count} days";
"lng_signin_reset_hours#one" = "{count} hour";
"lng_signin_reset_hours#other" = "{count} hours";
"lng_signin_reset_minutes#one" = "{count} minute";
"lng_signin_reset_minutes#other" = "{count} minutes";
"lng_signin_reset_in_days" = "{days_count} {hours_count} {minutes_count}";
"lng_signin_reset_in_hours" = "{hours_count} {minutes_count}";
"lng_signin_reset_cancelled" = "Your recent attempts to reset this account have been cancelled by its active user. Please try again in 7 days.";

"lng_signup_title" = "Your Info";
"lng_signup_desc" = "Please enter your name and\nupload a photo.";

"lng_signup_firstname" = "First Name";
"lng_signup_lastname" = "Last Name";

"lng_dlg_filter" = "Rechercher";
"lng_dlg_new_group_name" = "Group name";
"lng_dlg_new_channel_name" = "Channel name";
"lng_no_contacts" = "You have no contacts";
"lng_no_chats" = "Your chats will be here";
"lng_contacts_loading" = "Loading...";
"lng_contacts_not_found" = "No contacts found";
"lng_dlg_search_chat" = "Search in this chat";
"lng_dlg_search_channel" = "Search in this channel";
"lng_dlg_search_for_messages" = "Search for messages";
"lng_update_telegram" = "Update Telegram";

"lng_settings_save" = "Save";
"lng_settings_upload" = "Set Profile Photo";
"lng_settings_crop_profile" = "Select an area for your profile photo";
"lng_settings_uploading_photo" = "Uploading photo...";
"lng_settings_edit" = "Edit";
"lng_settings_drop_area_subtitle" = "to set it as your photo";

"lng_username_title" = "Pseudo";
"lng_username_about" = "Vous pouvez choisir un pseudo Telegram.\nSi vous en choisissez un, les autres\nutilisateurs pourront vous contacter\nà l'aide de votre pseudo sans connaître\nvotre numéro de téléphone.\n\nVous pouvez utiliser les lettres de a à z, les chiffres et les tirets bas _.\nLongueur minimale de 5 caractères.";
"lng_username_choose" = "Choisissez votre pseudo.";
"lng_username_invalid" = "Ce pseudo est invalide.";
"lng_username_occupied" = "Ce pseudo est déjà pris.";
"lng_username_too_short" = "Ce pseudo est trop court.";
"lng_username_bad_symbols" = "Ce pseudo utilise de mauvais caractères.";
"lng_username_available" = "Ce pseudo est disponible.";
"lng_username_not_found" = "Utilisateur @{user} introuvable.";
"lng_username_link_willbe" = "Ce lien ouvrira une conversation avec vous:";
"lng_username_link" = "Ce lien ouvre une conversation avec vous:";
"lng_username_copied" = "Lien copié vers le presse-papier.";

"lng_settings_section_info" = "Infos";
"lng_settings_phone_number" = "Numéro de téléphone:";
"lng_settings_username" = "Pseudo:";
"lng_settings_choose_username" = "Choisir un pseudo";

"lng_settings_section_notify" = "Notifications";
"lng_settings_desktop_notify" = "Notifications de bureau";
"lng_settings_show_name" = "Afficher l'expéditeur";
"lng_settings_show_preview" = "Afficher un aperçu du message";
"lng_settings_use_windows" = "Utiliser les notifications Windows";
"lng_settings_use_native_notifications" = "Utiliser les notifications natives";
"lng_settings_advanced_notifications" = "Position et nombre de notifications";
"lng_settings_notifications_position" = "Position sur l'écran";
"lng_settings_notifications_count" = "Nombre de notifications";
"lng_settings_sound_notify" = "Jouer un son";
"lng_settings_include_muted" = "Conversations muettes dans le compte de non-lus";

"lng_notification_preview" = "Vous avez de nouveaux messages";
"lng_notification_reply" = "Répondre";
"lng_notification_hide_all" = "Tout cacher";
"lng_notification_sample" = "Ceci est un example de notification";

"lng_settings_section_general" = "Général";
"lng_settings_change_lang" = "Changer de langue";
"lng_languages" = "Langues";
"lng_sure_save_language" = "Telegram va redémarrer pour changer de langue";
"lng_settings_update_automatically" = "Mises à jour automatiques";
"lng_settings_current_version_label" = "Version {version}.";
"lng_settings_current_version" = "Version {version}";
"lng_settings_check_now" = "Vérifier les mises à jour";
"lng_settings_update_checking" = "Recherche de mises à jour...";
"lng_settings_latest_installed" = "Telegram est à jour";
"lng_settings_downloading" = "Téléchargement de la mise à jour {ready} / {total} MB...";
"lng_settings_update_ready" = "Mise à jour prête";
"lng_settings_update_now" = "Relancer maintenant";
"lng_settings_update_fail" = "Erreur lors de la vérification :(";
"lng_settings_workmode_tray" = "Icône de la barre";
"lng_settings_workmode_window" = "Icône de la barre des tâches";
"lng_settings_auto_start" = "Lancer Telegram au démarrage";
"lng_settings_start_min" = "Lancer minimisé";
"lng_settings_add_sendto" = "Placer Telegram dans le menu «Envoyer vers»";
"lng_settings_section_scale" = "Échelle de l'interface";
"lng_settings_scale_auto" = "Auto ({cur})";

"lng_settings_section_chat_settings" = "Paramètres des conversations";
"lng_settings_replace_emojis" = "Remplacer par des emoji";
"lng_settings_view_emojis" = "Afficher la liste";
"lng_settings_emoji_list" = "Emoji supportés";
"lng_settings_send_enter" = "Envoyer en appuyant sur Entrée";
"lng_settings_send_ctrlenter" = "Envoyer en appuyant sur Ctrl + Entrée";
"lng_settings_send_cmdenter" = "Envoyer en appuyant sur Cmd + Entrée";

"lng_settings_section_background" = "Arrière plan des conversations";
"lng_settings_bg_use_default" = "Utiliser le thème par défaut";
"lng_settings_bg_from_gallery" = "Choisir depuis la galerie";
"lng_settings_bg_from_file" = "Choisir depuis un fichier";
"lng_settings_bg_edit_theme" = "Editer le thème";
"lng_settings_bg_tile" = "Arrière plan en mosaïque";
"lng_settings_adaptive_wide" = "Dispositions adaptée aux grands écrans";

"lng_backgrounds_header" = "Choose your new chat background";
"lng_theme_sure_keep" = "Keep this color theme?";
"lng_theme_reverting#one" = "Reverting to the old color theme in {count} second.";
"lng_theme_reverting#other" = "Reverting to the old color theme in {count} seconds.";
"lng_theme_keep_changes" = "Keep changes";
"lng_theme_revert" = "Revert";

"lng_download_path_dont_ask" = "Don't ask download path for each file";
"lng_download_path_label" = "Download path:";
"lng_download_path_temp" = "temp folder";
"lng_download_path_default" = "default folder";
"lng_download_path_clear" = "Clear all";
"lng_download_path_header" = "Choose download path";
"lng_download_path_default_radio" = "Telegram folder in system «Downloads»";
"lng_download_path_temp_radio" = "Temp folder, cleared on logout or uninstall";
"lng_download_path_dir_radio" = "Custom folder, cleared only manually";
"lng_download_path_choose" = "Choose download path";
"lng_sure_clear_downloads" = "Do you want to remove all downloaded files from temp folder? It is done automatically on logout or program uninstall.";
"lng_download_path_failed" = "File download could not be started. It could happen because of a bad download location.\n\nYou can change download path in Settings.";
"lng_download_path_settings" = "Settings";
"lng_download_finish_failed" = "File download could not be finished.\n\nWould you like to try again?";
"lng_download_path_clearing" = "Clearing...";
"lng_download_path_cleared" = "Cleared!";
"lng_download_path_clear_failed" = "Clear failed :(";

"lng_settings_section_privacy" = "Privacy and Security";

"lng_local_storage_title" = "Local storage";
"lng_settings_no_data_cached" = "No cached data found!";
"lng_settings_images_cached#one" = "{count} image, {size}";
"lng_settings_images_cached#other" = "{count} images, {size}";
"lng_settings_audios_cached#one" = "{count} voice message, {size}";
"lng_settings_audios_cached#other" = "{count} voice messages, {size}";
"lng_local_storage_clear" = "Clear all";
"lng_local_storage_clearing" = "Clearing...";
"lng_local_storage_cleared" = "Cleared!";
"lng_local_storage_clear_failed" = "Clear failed :(";

"lng_settings_section_advanced_settings" = "Advanced Settings";
"lng_settings_enable_night_theme" = "Enable night mode";
"lng_settings_disable_night_theme" = "Disable night mode";

"lng_passcode_remove_button" = "Remove";

"lng_passcode_turn_on" = "Turn on local passcode";
"lng_passcode_change" = "Change local passcode";
"lng_passcode_create" = "Local passcode";
"lng_passcode_remove" = "Remove local passcode";
"lng_passcode_turn_off" = "Turn off";
"lng_passcode_autolock" = "Auto-Lock";
"lng_passcode_autolock_away" = "Auto-Lock if away for:";
"lng_passcode_autolock_inactive" = "Auto-Lock if inactive for:";
"lng_passcode_autolock_minutes#one" = "{count} minute";
"lng_passcode_autolock_minutes#other" = "{count} minutes";
"lng_passcode_autolock_hours#one" = "{count} hour";
"lng_passcode_autolock_hours#other" = "{count} hours";
"lng_passcode_enter_old" = "Enter current passcode";
"lng_passcode_enter_first" = "Enter a passcode";
"lng_passcode_enter_new" = "Enter new passcode";
"lng_passcode_confirm_new" = "Re-enter new passcode";
"lng_passcode_about" = "When a local passcode is set, a lock icon appears at the top of your chats list. Click it to lock the app.\n\nNote: if you forget your local passcode, you'll need to relogin in Telegram Desktop.";
"lng_passcode_differ" = "Passcodes are different";
"lng_passcode_wrong" = "Wrong passcode";
"lng_passcode_is_same" = "Passcode was not changed";
"lng_passcode_enter" = "Enter your local passcode";
"lng_passcode_ph" = "Your passcode";
"lng_passcode_submit" = "Submit";
"lng_passcode_logout" = "Log out";
"lng_passcode_need_unblock" = "You need to unlock me first.";

"lng_cloud_password_waiting" = "Confirmation link sent to {email}...";
"lng_cloud_password_change" = "Change cloud password";
"lng_cloud_password_create" = "Cloud password";
"lng_cloud_password_remove" = "Remove cloud password";
"lng_cloud_password_set" = "Enable two-step verification";
"lng_cloud_password_edit" = "Change cloud password";
"lng_cloud_password_enter_old" = "Enter current password";
"lng_cloud_password_enter_first" = "Enter a password";
"lng_cloud_password_enter_new" = "Enter new password";
"lng_cloud_password_confirm_new" = "Re-enter new password";
"lng_cloud_password_hint" = "Enter password hint";
"lng_cloud_password_change_hint" = "Enter new password hint";
"lng_cloud_password_bad" = "Password and hint cannot be the same.";
"lng_cloud_password_email" = "Enter recovery e-mail";
"lng_cloud_password_bad_email" = "Incorrect e-mail, please try other.";
"lng_cloud_password_about" = "This password will be asked when you log in on a new device in addition to the pin code.";
"lng_cloud_password_about_recover" = "Warning! Are you sure you don't want to\nadd a password recovery e-mail?\n\nIf you forget your password, you will\nlose access to your Telegram account.";
"lng_cloud_password_skip_email" = "Skip e-mail";
"lng_cloud_password_almost" = "A confirmation link was sent to the\ne-mail you provided. Two-step verification will be enabled as soon as you follow that link.";
"lng_cloud_password_was_set" = "Two-step verification enabled.";
"lng_cloud_password_updated" = "Your cloud password was updated.";
"lng_cloud_password_removed" = "Two-step verification was disabled.";
"lng_cloud_password_differ" = "Passwords do not match";
"lng_cloud_password_wrong" = "Wrong cloud password";
"lng_cloud_password_is_same" = "Password was not changed";

"lng_connection_type" = "Connection type:";
"lng_connection_auto_connecting" = "Default (connecting...)";
"lng_connection_auto" = "Default ({transport} used)";
"lng_connection_proxy_connecting" = "Connecting through proxy...";
"lng_connection_proxy" = "{transport} with proxy";
"lng_connection_header" = "Connection type";
"lng_connection_auto_rb" = "Auto (TCP if available or HTTP)";
"lng_connection_http_proxy_rb" = "HTTP with custom http-proxy";
"lng_connection_tcp_proxy_rb" = "TCP with custom socks5-proxy";
"lng_connection_try_ipv6" = "Try connecting through IPv6";
"lng_connection_host_ph" = "Hostname";
"lng_connection_port_ph" = "Port";
"lng_connection_user_ph" = "Username";
"lng_connection_password_ph" = "Password";
"lng_connection_save" = "Save";

"lng_settings_blocked_users" = "Blocked users";
"lng_settings_last_seen_privacy" = "Last seen privacy";
"lng_settings_calls_privacy" = "Phone calls privacy";
"lng_settings_groups_invite_privacy" = "Group invite settings";
"lng_settings_show_sessions" = "Show all sessions";
"lng_settings_self_destruct" = "Account self-destruct settings";
"lng_settings_change_phone" = "Change phone number";

"lng_settings_reset" = "Terminate all other sessions";
"lng_settings_reset_sure" = "Are you sure you want to terminate\nall other sessions?";
"lng_settings_reset_one_sure" = "Do you want to terminate this session?";
"lng_settings_reset_button" = "Terminate";
"lng_settings_reset_done" = "Other sessions terminated";
"lng_settings_manage_local_storage" = "Manage local storage";
"lng_settings_ask_question" = "Ask a Question";
"lng_settings_ask_sure" = "Please note that Telegram Support is done by volunteers. We try to respond as quickly as possible, but it may take a while.\n\nPlease take a look at the Telegram FAQ: it has important troubleshooting tips and answers to most questions.";
"lng_settings_faq_button" = "Go to FAQ";
"lng_settings_ask_ok" = "Ask";
"lng_settings_faq" = "Telegram FAQ";
"lng_settings_logout" = "Log Out";
"lng_sure_logout" = "Are you sure you want to log out?";

"lng_settings_need_restart" = "You need to restart for applying some of the new settings. Restart now?";
"lng_settings_restart_now" = "RESTART";
"lng_settings_restart_later" = "LATER";

"lng_sessions_header" = "Current session";
"lng_sessions_other_header" = "Active sessions";
"lng_sessions_no_other" = "No other sessions";
"lng_sessions_other_desc" = "You can log in to Telegram from other mobile, tablet and desktop devices, using the same phone number. All your data will be instantly synchronized.";
"lng_sessions_terminate_all" = "Terminate all other sessions";

"lng_blocked_list_title" = "Blocked users";
"lng_blocked_list_unknown_phone" = "unknown phone";
"lng_blocked_list_unblock" = "Unblock";
"lng_blocked_list_add" = "Block user";
"lng_blocked_list_add_title" = "Select user to block";
"lng_blocked_list_already_blocked" = "blocked already";
"lng_blocked_list_about" = "Blocked users can't send you messages or add you to groups. They will not see your profile pictures, online and last seen status.";
"lng_blocked_list_not_found" = "No users found.";

"lng_edit_privacy_everyone" = "Everybody";
"lng_edit_privacy_contacts" = "My contacts";
"lng_edit_privacy_nobody" = "Nobody";
"lng_edit_privacy_exceptions" = "Add exceptions";

"lng_edit_privacy_lastseen_title" = "Last seen privacy";
"lng_edit_privacy_lastseen_description" = "You can choose who can see your last seen time:";
"lng_edit_privacy_lastseen_warning" = "Important: you won't be able to see Last Seen times for people with whom you don't share your Last Seen time. Approximate last seen will be shown instead (recently, within a week, within a month).";
"lng_edit_privacy_lastseen_always_empty" = "Always share with";
"lng_edit_privacy_lastseen_always#one" = "Always share with {count} user";
"lng_edit_privacy_lastseen_always#other" = "Always share with {count} users";
"lng_edit_privacy_lastseen_never_empty" = "Never share with";
"lng_edit_privacy_lastseen_never#one" = "Never share with {count} user";
"lng_edit_privacy_lastseen_never#other" = "Never share with {count} users";
"lng_edit_privacy_lastseen_exceptions" = "These settings will override the values above.";
"lng_edit_privacy_lastseen_always_title" = "Always share with";
"lng_edit_privacy_lastseen_never_title" = "Never share with";

"lng_edit_privacy_groups_title" = "Group invite settings";
"lng_edit_privacy_groups_description" = "You can choose who can add you to groups and channels with granular precision:";
"lng_edit_privacy_groups_always_empty" = "Always allow";
"lng_edit_privacy_groups_always#one" = "Always allow {count} user";
"lng_edit_privacy_groups_always#other" = "Always allow {count} users";
"lng_edit_privacy_groups_never_empty" = "Never allow";
"lng_edit_privacy_groups_never#one" = "Never allow {count} user";
"lng_edit_privacy_groups_never#other" = "Never allow {count} users";
"lng_edit_privacy_groups_exceptions" = "These users will or will not be able to add you to groups and channels regardless of the settings above.";
"lng_edit_privacy_groups_always_title" = "Always allow";
"lng_edit_privacy_groups_never_title" = "Never allow";

"lng_edit_privacy_calls_title" = "Phone calls privacy";
"lng_edit_privacy_calls_description" = "You can restrict who can call you:";
"lng_edit_privacy_calls_always_empty" = "Always allow";
"lng_edit_privacy_calls_always#one" = "Always allow {count} user";
"lng_edit_privacy_calls_always#other" = "Always allow {count} users";
"lng_edit_privacy_calls_never_empty" = "Never allow";
"lng_edit_privacy_calls_never#one" = "Never allow {count} user";
"lng_edit_privacy_calls_never#other" = "Never allow {count} users";
"lng_edit_privacy_calls_exceptions" = "These users will or will not be able to call you regardless of the settings above.";
"lng_edit_privacy_calls_always_title" = "Always allow";
"lng_edit_privacy_calls_never_title" = "Never allow";

"lng_self_destruct_title" = "Account self-destruction";
"lng_self_destruct_description" = "If you don't come online at least once within this period, your account will be deleted along with all groups, messages and contacts.";
"lng_self_destruct_months#one" = "{count} month";
"lng_self_destruct_months#other" = "{count} months";
"lng_self_destruct_years#one" = "{count} year";
"lng_self_destruct_years#other" = "{count} years";

"lng_change_phone_title" = "Change phone number";
"lng_change_phone_description" = "You can change your Telegram number\nhere. Your account and all your cloud data\n— messages, media, contacts, etc. will be\nmoved to the new number.\n\n[b]Important[/b]: all your Telegram contacts will\nget your [b]new number[/b] added to their address\nbook, provided they had your old number and\nyou haven't blocked them in Telegram.";
"lng_change_phone_warning" = "All your Telegram contacts will get your new number added to their address book, provided they had your old number and you haven't blocked them in Telegram.";
"lng_change_phone_occupied" = "The number {phone} is already connected to a Telegram account. Please delete that account before migrating to the new number.";
"lng_change_phone_button" = "Change number";
"lng_change_phone_new_title" = "Enter new number";
"lng_change_phone_new_description" = "We will send an SMS with a confirmation code to your new number.";
"lng_change_phone_new_submit" = "Submit";
"lng_change_phone_code_title" = "Enter code";
"lng_change_phone_code_description" = "We've sent an SMS with a confirmation code to your phone {phone}.";
"lng_change_phone_success" = "Your phone number has been changed.";

"lng_preview_loading" = "Getting Link Info...";

"lng_profile_chat_unaccessible" = "Groupe inaccessible";
"lng_profile_about_section" = "À propos";
"lng_profile_description_section" = "Description";
"lng_profile_settings_section" = "Paramètres";
"lng_profile_actions_section" = "Actions";
"lng_profile_bot_settings" = "Paramètres";
"lng_profile_bot_help" = "Aide";
"lng_profile_invite_link_section" = "Lien d'invitation";
"lng_profile_create_public_link" = "Créer un lien public";
"lng_profile_edit_public_link" = "Modifier le lien public";
"lng_profile_manage_admins" = "Gérer les administrateurs";
"lng_profile_manage_blocklist" = "Gérer les utilisateurs bannis";
"lng_profile_manage_restrictedlist" = "Gérer les utilisateurs restreints";
"lng_profile_recent_actions" = "Actions récentes";
"lng_profile_common_groups#one" = "{count} groupes en commun";
"lng_profile_common_groups#other" = "{count} groupes en commun";
"lng_profile_common_groups_section" = "Groupes en commun";
"lng_profile_participants_section" = "Membres";
"lng_profile_info_section" = "Infos";
"lng_profile_mobile_number" = "Numéro de téléphone:";
"lng_profile_username" = "Pseudo:";
"lng_profile_link" = "Lien:";
"lng_profile_add_contact" = "Ajouter un contact";
"lng_profile_edit_contact" = "Modifier";
"lng_profile_enable_notifications" = "Notifications";
"lng_profile_clear_history" = "Effacer l'historique";
"lng_profile_delete_conversation" = "Supprimer la conversation";
"lng_profile_clear_and_exit" = "Supprimer et quitter";
"lng_profile_leave_channel" = "Quitter la chaîne";
"lng_profile_delete_channel" = "Supprimer la chaîne";
"lng_profile_leave_group" = "Quitter le groupe";
"lng_profile_delete_group" = "Supprimer le groupe";
"lng_profile_report" = "Reporter";
"lng_profile_search_messages" = "Chercher des messages";
"lng_profile_block_user" = "Bloquer l'utilisateur";
"lng_profile_unblock_user" = "Débloquer l'utilisateur";
"lng_profile_block_bot" = "Arrêter et bloquer le bot";
"lng_profile_unblock_bot" = "Débloquer le bot";
"lng_profile_send_message" = "Envoyer un message";
"lng_profile_share_contact" = "Partager le contact";
"lng_profile_invite_to_group" = "Ajouter au groupe";
"lng_profile_delete_contact" = "Supprimer";
"lng_profile_set_group_photo" = "Définir la photo";
"lng_profile_add_participant" = "Ajouter des membres";
"lng_profile_view_channel" = "Voir la chaîne";
"lng_profile_join_channel" = "Rejoindre";
"lng_profile_delete_and_exit" = "Quitter";
"lng_profile_kick" = "Renvoyer";
"lng_profile_admin" = "admin";
"lng_profile_edit_permissions" = "Modifier";
"lng_profile_sure_kick" = "Renvoyer {user} du groupe ?";
"lng_profile_sure_kick_channel" = "Renvoyer {user} de la chaîne ?";
"lng_profile_sure_kick_admin" = "Renvoyer {user} des administrateurs ?";
"lng_profile_loading" = "Chargement...";
"lng_profile_shared_media" = "Médias partagés";
"lng_profile_no_media" = "Aucun média dans cette conversation.";
"lng_profile_photos#one" = "{count} photo";
"lng_profile_photos#other" = "{count} photos";
"lng_profile_photos_header" = "Photos";
"lng_profile_videos#one" = "{count} vidéo";
"lng_profile_videos#other" = "{count} vidéos";
"lng_profile_videos_header" = "Vidéos";
"lng_profile_songs#one" = "{count} fichier audio";
"lng_profile_songs#other" = "{count} fichiers audio";
"lng_profile_songs_header" = "Fichiers audio";
"lng_profile_files#one" = "{count} fichier";
"lng_profile_files#other" = "{count} fichiers";
"lng_profile_files_header" = "Fichiers";
"lng_profile_audios#one" = "{count} message vocal";
"lng_profile_audios#other" = "{count} messages vocaux";
"lng_profile_audios_header" = "Messages vocaux";
"lng_profile_shared_links#one" = "{count} lien partagé";
"lng_profile_shared_links#other" = "{count} liens partagés";
"lng_profile_shared_links_header" = "Liens partagés";
"lng_profile_copy_phone" = "Copier le numéro de téléphone";
"lng_profile_copy_fullname" = "Copier le nom";
"lng_profile_drop_area_title" = "Déposer l'image ici";
"lng_profile_drop_area_subtitle" = "pour la définir en tant que photo de groupe";
"lng_profile_drop_area_subtitle_channel" = "pour la définir en tant que photo de chaîne";
"lng_profile_top_bar_share_contact" = "Partager";

"lng_report_title" = "Report channel";
"lng_report_group_title" = "Report group";
"lng_report_bot_title" = "Report bot";
"lng_report_reason_spam" = "Spam";
"lng_report_reason_violence" = "Violence";
"lng_report_reason_pornography" = "Pornography";
"lng_report_reason_other" = "Other";
"lng_report_reason_description" = "Description";
"lng_report_button" = "Report";
"lng_report_thanks" = "Thank you! Your report will be reviewed by our team very soon.";

"lng_channel_add_admins" = "New administrator";
"lng_channel_add_members" = "Add members";
"lng_channel_add_banned" = "Ban user";
"lng_channel_add_restricted" = "Restrict user";
"lng_channel_members" = "Members";
"lng_channel_only_last_shown#one" = "Only the last {count} member is shown here";
"lng_channel_only_last_shown#other" = "Only the last {count} members are shown here";
"lng_channel_admins" = "Administrators";
"lng_channel_add_admin" = "Add Administrator";
"lng_channel_admins_too_much" = "Sorry, you have reached the limit of the administrators. Please remove one administrator first.";
"lng_channel_admin_status_creator" = "Creator";
"lng_channel_admin_status_promoted_by" = "Promoted by {user}";

"lng_group_blocked_list_about" = "Banned users are removed from the group and can only come back if invited by an admin.\nInvite links don't work for them.";

"lng_chat_all_members_admins" = "All Members Are Admins";
"lng_chat_about_all_admins" = "Group members can add new members, edit name and photo of the group.";
"lng_chat_about_admins" = "Group admins can add and remove members, edit name and photo of the group.";

"lng_participant_filter" = "Search";
"lng_participant_invite" = "Invite";
"lng_participant_invite_sorry#one" = "Sorry, you can only add the first {count} member to a channel personally.\n\nFrom now on, people will need to join via your invite link.";
"lng_participant_invite_sorry#other" = "Sorry, you can only add the first {count} members to a channel personally.\n\nFrom now on, people will need to join via your invite link.";
"lng_create_group_back" = "Back";
"lng_create_group_next" = "Next";
"lng_create_group_create" = "Create";
"lng_create_group_title" = "New Group";
"lng_create_channel_title" = "New Channel";
"lng_create_public_channel_title" = "Public Channel";
"lng_create_public_channel_about" = "Anyone can find the channel in search and join";
"lng_create_private_channel_title" = "Private Channel";
"lng_create_private_channel_about" = "Only people with a special invite link may join";
"lng_create_public_group_title" = "Public Group";
"lng_create_public_group_about" = "Anyone can find the group in search and join, chat history is available to everybody";
"lng_create_private_group_title" = "Private Group";
"lng_create_private_group_about" = "People can only join if they were invited or have an invite link";
"lng_create_group_skip" = "Skip";

"lng_create_channel_link_invalid" = "This link is invalid";
"lng_create_channel_link_occupied" = "Sorry, this link is already occupied";
"lng_create_channel_link_too_short" = "Sorry, this link is too short";
"lng_create_channel_link_bad_symbols" = "Sorry, this link has bad symbols";
"lng_create_channel_link_available" = "This link is available";
"lng_create_channel_link_copied" = "Link copied to clipboard";

"lng_create_group_crop" = "Select an area for group photo";
"lng_create_channel_crop" = "Select an area for channel photo";

"lng_failed_add_participant" = "Could not add user. Please try again later.";
"lng_failed_add_not_mutual" = "Sorry, if a person leaves a group, only a mutual contact can bring them back (they need to have your phone number, and you need theirs).";
"lng_failed_add_not_mutual_channel" = "Sorry, if a person leaves a channel, only a mutual contact can bring them back (they need to have your phone number, and you need theirs).";

"lng_sure_delete_contact" = "Are you sure, you want to delete {contact} from your contact list?";
"lng_sure_delete_history" = "Are you sure, you want to delete all message history with {contact}?\n\nThis action cannot be undone.";
"lng_sure_delete_group_history" = "Are you sure, you want to delete all message history in «{group}»?\n\nThis action cannot be undone.";
"lng_sure_delete_and_exit" = "Are you sure, you want to delete all message history and leave «{group}»?\n\nThis action cannot be undone.";
"lng_sure_leave_channel" = "Are you sure, you want to leave\nthis channel?";
"lng_sure_delete_channel" = "Are you sure, you want to delete this channel? All members will be removed and all messages will be lost.";
"lng_sure_leave_group" = "Are you sure, you want to leave\nthis group? This action cannot be undone.";
"lng_sure_delete_group" = "Are you sure, you want to delete this group? All members will be removed and all messages will be lost.";

"lng_message_empty" = "Empty Message";
"lng_message_unsupported" = "This message is not supported by your version of Telegram Desktop. Please update to the last version in Settings or install it from {link}";

"lng_duration_seconds#one" = "{count} second";
"lng_duration_seconds#other" = "{count} seconds";
"lng_duration_minsec_minutes#one" = "{count} min";
"lng_duration_minsec_minutes#other" = "{count} min";
"lng_duration_minsec_seconds#one" = "{count} sec";
"lng_duration_minsec_seconds#other" = "{count} sec";
"lng_duration_minutes_seconds" = "{minutes_count} {seconds_count}";

"lng_action_add_user" = "{from} added {user}";
"lng_action_add_users_many" = "{from} added {users}";
"lng_action_add_users_and_one" = "{accumulated}, {user}";
"lng_action_add_users_and_last" = "{accumulated} and {user}";
"lng_action_add_you" = "{from} added you to this channel";
"lng_action_you_joined" = "You joined this channel";
"lng_action_add_you_group" = "{from} added you to this group";
"lng_action_you_joined_group" = "You joined this group";
"lng_action_kick_user" = "{from} removed {user}";
"lng_action_user_left" = "{from} left the group";
"lng_action_user_joined" = "{from} joined the group";
"lng_action_user_joined_by_link" = "{from} joined the group via invite link";
"lng_action_user_registered" = "{from} just joined Telegram";
"lng_action_removed_photo" = "{from} removed group photo";
"lng_action_removed_photo_channel" = "Channel photo removed";
"lng_action_changed_photo" = "{from} updated group photo";
"lng_action_changed_photo_channel" = "Channel photo updated";
"lng_action_changed_title" = "{from} changed group name to «{title}»";
"lng_action_changed_title_channel" = "Channel name was changed to «{title}»";
"lng_action_created_chat" = "{from} created group «{title}»";
"lng_action_created_channel" = "Channel created";
"lng_action_group_migrate" = "The group was upgraded to a supergroup";
"lng_action_pinned_message" = "{from} pinned «{text}»";
"lng_action_pinned_media" = "{from} pinned {media}";
"lng_action_pinned_media_photo" = "a photo";
"lng_action_pinned_media_video" = "a video";
"lng_action_pinned_media_audio" = "an audio file";
"lng_action_pinned_media_voice" = "a voice message";
"lng_action_pinned_media_video_message" = "a video message";
"lng_action_pinned_media_file" = "a file";
"lng_action_pinned_media_gif" = "a GIF animation";
"lng_action_pinned_media_contact" = "a contact information";
"lng_action_pinned_media_location" = "a location mark";
"lng_action_pinned_media_sticker" = "a sticker";
"lng_action_pinned_media_emoji_sticker" = "a {emoji} sticker";
"lng_action_pinned_media_game" = "the game «{game}»";
"lng_action_game_score#one" = "{from} scored {count} in {game}";
"lng_action_game_score#other" = "{from} scored {count} in {game}";
"lng_action_game_you_scored#one" = "You scored {count} in {game}";
"lng_action_game_you_scored#other" = "You scored {count} in {game}";
"lng_action_game_score_no_game#one" = "{from} scored {count}";
"lng_action_game_score_no_game#other" = "{from} scored {count}";
"lng_action_game_you_scored_no_game#one" = "You scored {count}";
"lng_action_game_you_scored_no_game#other" = "You scored {count}";
"lng_action_payment_done" = "You have just successfully transferred {amount} to {user}";
"lng_action_payment_done_for" = "You have just successfully transferred {amount} to {user} for {invoice}";

"lng_profile_migrate_reached#one" = "{count} member limit reached";
"lng_profile_migrate_reached#other" = "{count} members limit reached";
"lng_profile_migrate_body" = "To get over this limit, you can upgrade your group to a supergroup.";
"lng_profile_migrate_learn_more" = "Learn more »";
"lng_profile_migrate_about" = "If you'd like to go over this limit, you can upgrade your group to a supergroup. In supergroups:";
"lng_profile_migrate_feature1#one" = "— The members limit is {count} user";
"lng_profile_migrate_feature1#other" = "— The members limit is {count} users";
"lng_profile_migrate_feature2" = "— New members see the entire chat history";
"lng_profile_migrate_feature3" = "— Admins delete messages for everyone";
"lng_profile_migrate_feature4" = "— Notifications are muted by default";
"lng_profile_migrate_button" = "Upgrade to supergroup";
"lng_profile_migrate_sure" = "Are you sure you want to upgrade this group to supergroup? This action cannot be undone.";
"lng_profile_convert_button" = "Convert to supergroup";
"lng_profile_convert_title" = "Convert to supergroup";
"lng_profile_convert_about" = "In supergroups:";
"lng_profile_convert_feature1" = "— New members see the full message history";
"lng_profile_convert_feature2" = "— Messages are deleted for all members";
"lng_profile_convert_feature3" = "— Admins can pin important messages";
"lng_profile_convert_feature4" = "— Creator can set a public link for the group";
"lng_profile_convert_warning" = "{bold_start}Note:{bold_end} This action can not be undone";
"lng_profile_convert_confirm" = "Convert";
"lng_profile_add_more_after_upgrade#one" = "You will be able to add up to {count} member after you upgrade your group to a supergroup.";
"lng_profile_add_more_after_upgrade#other" = "You will be able to add up to {count} members after you upgrade your group to a supergroup.";

"lng_channel_not_accessible" = "Sorry, this channel is not accessible.";
"lng_group_not_accessible" = "Sorry, this group is not accessible.";

"lng_channels_too_much_public_about" = "Sorry, you have reserved too many public usernames. You can revoke the link from one of your older groups or channels.";
"lng_channels_too_much_public_revoke_confirm_group" = "Are you sure you want to revoke the link {link}?\n\nThe group «{group}» will become private.";
"lng_channels_too_much_public_revoke_confirm_channel" = "Are you sure you want to revoke the link {link}?\n\nThe channel «{group}» will become private.";
"lng_channels_too_much_public_revoke" = "Revoke";

"lng_group_invite_bad_link" = "This invite link is broken or has expired.";
"lng_group_invite_want_join" = "Do you want to join the group «{title}»?";
"lng_group_invite_want_join_channel" = "Do you want to join the channel «{title}»?";
"lng_group_invite_join" = "Join";

"lng_group_invite_members#one" = "{count} member, among them:";
"lng_group_invite_members#other" = "{count} members, among them:";

"lng_group_invite_link" = "Invite link:";
"lng_group_invite_create" = "Create an invite link";
"lng_group_invite_about" = "Telegram users will be able to join\nyour group by following this link.";
"lng_group_invite_create_new" = "Revoke invite link";
"lng_group_invite_about_new" = "Your previous link will be deactivated and we'll generate a new invite link for you.";
"lng_group_invite_copied" = "Invite link copied to clipboard.";
"lng_group_invite_no_room" = "Unable to join this group because there are too many members in it already.";

"lng_channel_public_link_copied" = "Link copied to clipboard.";

"lng_forwarded" = "Forwarded from {user}";
"lng_forwarded_date" = "Original: {date}";
"lng_forwarded_channel" = "Forwarded from {channel}";
"lng_forwarded_via" = "Forwarded from {user} via {inline_bot}";
"lng_forwarded_channel_via" = "Forwarded from {channel} via {inline_bot}";
"lng_forwarded_signed" = "{channel} ({user})";
"lng_in_reply_to" = "In reply to";
"lng_edited" = "edited";
"lng_edited_date" = "Edited: {date}";
"lng_cancel_edit_post_sure" = "Cancel editing?";
"lng_cancel_edit_post_yes" = "Yes";
"lng_cancel_edit_post_no" = "No";

"lng_bot_share_location_unavailable" = "Sorry, the location sharing is currently unavailable in Telegram Desktop.";
"lng_bot_inline_geo_unavailable" = "Sorry, this bot requires location sharing.\nIt is not available in Telegram Desktop.";
"lng_bot_share_phone" = "Share Phone Number?";
"lng_bot_share_phone_confirm" = "Share";

"lng_attach_failed" = "Failed";
"lng_attach_file" = "File";
"lng_attach_photo" = "Photo";

"lng_media_type" = "Media type";
"lng_media_type_photos" = "Photos";
"lng_media_type_videos" = "Videos";
"lng_media_type_songs" = "Audio files";
"lng_media_type_files" = "Files";
"lng_media_type_audios" = "Voice messages";
"lng_media_type_links" = "Shared links";

"lng_media_open_with" = "Open With";
"lng_media_download" = "Download";
"lng_media_cancel" = "Cancel";
"lng_media_video" = "Video";
"lng_media_audio" = "Voice message";

"lng_media_auto_settings" = "Automatic media download settings";
"lng_media_auto_photo" = "Automatic photo download";
"lng_media_auto_audio" = "Automatic voice message download";
"lng_media_auto_gif" = "Automatic GIF download";
"lng_media_auto_private_chats" = "Private chats";
"lng_media_auto_groups" = "Groups and channels";
"lng_media_auto_play" = "Autoplay";

"lng_emoji_category0" = "Frequently used";
"lng_emoji_category1" = "People";
"lng_emoji_category2" = "Nature";
"lng_emoji_category3" = "Food & Drink";
"lng_emoji_category4" = "Activity";
"lng_emoji_category5" = "Travel & Places";
"lng_emoji_category6" = "Objects";
"lng_emoji_category7" = "Symbols & Flags";
"lng_emoji_hide_panel" = "Click here to hide the emoji sidebar";

"lng_recent_stickers" = "Frequently used";
"lng_switch_stickers" = "Stickers";
"lng_switch_emoji" = "Emoji";
"lng_switch_gifs" = "GIFs";
"lng_stickers_featured_add" = "Add";
"lng_gifs_search" = "Search GIFs";
"lng_gifs_no_saved" = "You have no saved GIFs yet.";

"lng_inline_bot_no_results" = "No results.";
"lng_inline_bot_via" = "via {inline_bot}";

"lng_box_remove" = "Remove";

"lng_stickers_installed_tab" = "Stickers";
"lng_stickers_featured_tab" = "Trending";
"lng_stickers_archived_tab" = "Archived";
"lng_stickers_remove_pack" = "Remove «{sticker_pack}»?";
"lng_stickers_add_pack" = "Add stickers";
"lng_stickers_share_pack" = "Share Stickers";
"lng_stickers_not_found" = "Sticker pack not found.";
"lng_stickers_packs_archived" = "Some of your unused stickers have been archived to make room for the sets you've activated.";
"lng_stickers_archived" = "Archived Stickers";
"lng_stickers_copied" = "Sticker pack link copied to clipboard.";
"lng_stickers_default_set" = "Great Minds";
"lng_stickers_you_have" = "Manage and reorder sticker packs";
"lng_stickers_featured" = "Trending Stickers";
"lng_stickers_return" = "Undo";
"lng_stickers_count#one" = "{count} sticker";
"lng_stickers_count#other" = "{count} stickers";
"lng_stickers_masks_pack" = "This is a pack of mask stickers. You can use them in the photo editor on our mobile apps.";

"lng_in_dlg_photo" = "Photo";
"lng_in_dlg_video" = "Video";
"lng_in_dlg_audio_file" = "Audio file";
"lng_in_dlg_contact" = "Contact";
"lng_in_dlg_audio" = "Voice message";
"lng_in_dlg_video_message" = "Video message";
"lng_in_dlg_file" = "File";
"lng_in_dlg_sticker" = "Sticker";
"lng_in_dlg_sticker_emoji" = "{emoji} Sticker";

"lng_ban_user" = "Ban User";
"lng_delete_all_from" = "Delete all from this user";
"lng_report_spam" = "Report Spam";
"lng_report_spam_hide" = "Hide";
"lng_report_spam_thanks" = "Thank you for your report!";
"lng_report_spam_sure" = "Are you sure you want to report spam from this user?";
"lng_report_spam_sure_group" = "Are you sure you want to report spam in this group?";
"lng_report_spam_sure_channel" = "Are you sure you want to report spam in this channel?";
"lng_report_spam_ok" = "Report";
"lng_cant_send_to_not_contact" = "Sorry, you can only send messages to\nmutual contacts at the moment.\n{more_info}";
"lng_cant_invite_not_contact" = "Sorry, you can only add mutual contacts\nto groups at the moment.\n{more_info}";
"lng_cant_send_to_not_contact_flood" = "You have contacted too many non-contacts today, please try again tomorrow. You will be able to reply today if this user messages you first.";
"lng_cant_invite_not_contact_flood" = "You can't add this user because you have contacted too many non-contacts today. Please try again tomorrow. You can ask another member to add this user to the group.";
"lng_cant_more_info" = "More info »";
"lng_cant_invite_banned" = "Sorry, only admin can add this user.";
"lng_cant_invite_privacy" = "Sorry, you cannot add this user to groups because of their privacy settings.";
"lng_cant_invite_privacy_channel" = "Sorry, you cannot add this user to channels because of their privacy settings.";
"lng_cant_do_this" = "Sorry, this action is unavailable.";

"lng_send_button" = "Envoyer";
"lng_message_ph" = "Écrire un message...";
"lng_broadcast_ph" = "Diffuser un message...";
"lng_broadcast_silent_ph" = "Diffusion silencieuse...";
"lng_record_cancel" = "Relâcher en dehors de ce champ pour annuler";
"lng_will_be_notified" = "Les membres seront notifiés lorsque vous posterez";
"lng_wont_be_notified" = "Les membres ne seront pas notifiés lorsque vous posterez";
"lng_willbe_history" = "Choisissez une conversation";
"lng_from_you" = "Vous";
"lng_from_draft" = "Brouillon";
"lng_bot_description" = "Que peut-faire ce bot ?";
"lng_unblock_button" = "Débloquer";
"lng_channel_join" = "Rejoindre la chaîne";
"lng_channel_mute" = "Rendre muet";
"lng_channel_unmute" = "Activer les notifications";

"lng_dialogs_text_with_from" = "{from_part} {message}";
"lng_dialogs_text_from_wrapped" = "{from}:";
"lng_dialogs_text_media" = "{media_part} {caption}";
"lng_dialogs_text_media_wrapped" = "{media},";
"lng_dialogs_show_all_chats" = "Afficher toutes les conversations";
"lng_dialogs_hide_muted_chats" = "Cacher les conversations muettes";

"lng_open_this_link" = "Ouvrir ce lien ?";
"lng_open_link" = "Ouvrir";
"lng_allow_bot_pass" = "Autorisez-vous {bot_name} à envoyer votre identifiant Telegram aux pages web que vous ouvrez via ce bot ?";
"lng_allow_bot" = "Autoriser";

"lng_bot_start" = "Démarrer";
"lng_bot_choose_group" = "Select a Group";
"lng_bot_no_groups" = "You have no groups";
"lng_bot_groups_not_found" = "No groups found";
"lng_bot_sure_invite" = "Add the bot to «{group}»?";
"lng_bot_already_in_group" = "The bot is already a member of the group.";
"lng_bot_choose_chat" = "Select a Chat";
"lng_bot_no_chats" = "You have no chats";
"lng_bot_chats_not_found" = "No chats found";
"lng_bot_sure_share_game" = "Share the game with {user}?";
"lng_bot_sure_share_game_group" = "Share the game with «{group}»?";

"lng_typing" = "en train d'écrire";
"lng_user_typing" = "{user} est en train d'écrire";
"lng_users_typing" = "{user} et {second_user} sont en train d'écrire";
"lng_many_typing#one" = "{count} est en train d'écrire";
"lng_many_typing#other" = "{count} sont en train d'écrire";
"lng_playing_game" = "joue à un jeu";
"lng_user_playing_game" = "{user} joue à un jeu";
"lng_users_playing_game" = "{user} et {second_user} jouent à un jeu";
"lng_many_playing_game#one" = "{count} joue à un jeu";
"lng_many_playing_game#other" = "{count} jouent à un jeu";
"lng_send_action_record_video" = "enregistre une vidéo";
"lng_user_action_record_video" = "{user} enregistre une vidéo";
"lng_send_action_upload_video" = "envoie une vidéo";
"lng_user_action_upload_video" = "{user} envoie une vidéo";
"lng_send_action_record_audio" = "enregistre un message vocal";
"lng_user_action_record_audio" = "{user} enregistre un message vocal";
"lng_send_action_upload_audio" = "envoie un message vocal";
"lng_user_action_upload_audio" = "{user} envoie un message vocal";
"lng_send_action_record_round" = "enregistre un message vidéo";
"lng_user_action_record_round" = "{user} enregistre un message vidéo";
"lng_send_action_upload_round" = "envoie un message vidéo";
"lng_user_action_upload_round" = "{user} envoie un message vidéo";
"lng_send_action_upload_photo" = "envoie une photo";
"lng_user_action_upload_photo" = "{user} envoie une photo";
"lng_send_action_upload_file" = "envoie un fichier";
"lng_user_action_upload_file" = "{user} envoie un fichier";
"lng_send_action_geo_location" = "envoie sa localisation";
"lng_user_action_geo_location" = "{user} envoie sa localisation";
"lng_send_action_choose_contact" = "choisit un contact";
"lng_user_action_choose_contact" = "{user} choisit un contact";
"lng_unread_bar#one" = "{count} message non lu";
"lng_unread_bar#other" = "{count} messages non lus";

"lng_maps_point" = "Localisation";
"lng_save_photo" = "Enregistrer l'image";
"lng_save_video" = "Enregistrer la vidéo";
"lng_save_audio_file" = "Enregistrer le fichier audio";
"lng_save_audio" = "Enregistrer le message vocal";
"lng_save_file" = "Enregistrer le fichier";
"lng_save_downloaded" = "{ready} / {total} {mb}";
"lng_duration_and_size" = "{duration}, {size}";
"lng_duration_played" = "{played} / {duration}";
"lng_date_and_duration" = "{date}, {duration}";
"lng_choose_image" = "Choisir une image";
"lng_choose_files" = "Choisir des fichiers";
"lng_game_tag" = "Jeu";

"lng_context_view_profile" = "Afficher le profil";
"lng_context_view_group" = "Afficher les infos du groupe";
"lng_context_view_channel" = "Afficher les infos de la chaîne";
"lng_context_pin_to_top" = "Épingler en haut";
"lng_context_unpin_from_top" = "Désépingler du haut";

"lng_context_promote_admin" = "Promouvoir admin";
"lng_context_edit_permissions" = "Modifier les permissions";
"lng_context_restrict_user" = "Restreindre l'utilisateur";
"lng_context_remove_from_group" = "Renvoyer du groupe";

"lng_context_copy_link" = "Copier le lien";
"lng_context_copy_post_link" = "Copier le lien du post";
"lng_context_copy_email" = "Copier l'adresse courriel";
"lng_context_copy_hashtag" = "Copier le mot-dièse";
"lng_context_copy_mention" = "Copier le pseudo";
"lng_context_save_image" = "Enregistrer l'image sous...";
"lng_context_forward_image" = "Transférer l'image";
"lng_context_delete_image" = "Supprimer l'image";
"lng_context_copy_image" = "Copier l'image";
"lng_context_close_image" = "Fermer l'image";
"lng_context_cancel_download" = "Annuler le téléchargement";
"lng_context_show_in_folder" = "Afficher dans le dossier";
"lng_context_show_in_finder" = "Afficher dans le Finder";
"lng_context_save_video" = "Enregistrer la vidéo sous...";
"lng_context_save_audio_file" = "Enregistrer le fichier audio sous...";
"lng_context_save_audio" = "Enregistrer le message vocal sous...";
"lng_context_pack_info" = "Infos sur l'ensemble";
"lng_context_pack_add" = "Ajouter les autocollants";
"lng_context_save_file" = "Enregistrer le fichier sous...";
"lng_context_forward_file" = "Transférer le fichier";
"lng_context_delete_file" = "Supprimer le fichier";
"lng_context_close_file" = "Fermer le fichier";
"lng_context_copy_text" = "Copier le texte";
"lng_context_open_gif" = "Ouvrir le GIF";
"lng_context_save_gif" = "Enregistrer le GIF";
"lng_context_to_msg" = "Aller au message";
"lng_context_reply_msg" = "Répondre";
"lng_context_edit_msg" = "Modifier";
"lng_context_forward_msg" = "Transférer le message";
"lng_context_delete_msg" = "Supprimer le message";
"lng_context_select_msg" = "Selectionner le message";
"lng_context_pin_msg" = "Épingler le message";
"lng_context_unpin_msg" = "Désépingler le message";
"lng_context_cancel_upload" = "Annuler l'envoi";
"lng_context_copy_selected" = "Copier le texte sélectionné";
"lng_context_copy_selected_items" = "Copier la sélection en tant que texte";
"lng_context_forward_selected" = "Transférer la sélection";
"lng_context_delete_selected" = "Supprimer la sélection";
"lng_context_clear_selection" = "Annuler la sélection";
"lng_really_send_image" = "Voulez-vous envoyer cette image ?";
"lng_really_send_file" = "Voulez-vous envoyer ce fichier ?";
"lng_really_share_contact" = "Voulez-vous partager ce contact ?";
"lng_send_images_compress#one" = "Compresser l'image";
"lng_send_images_compress#other" = "Compresser les images";
"lng_send_image_non_local" = "Impossible d'envoyer l'image non locale: {name}";
"lng_send_image_empty" = "Impossible d'envoyer l'image vide: {name}";
"lng_send_image_too_large" = "Impossible d'envoyer l'image (plus lourde que 1500 Mo): {name}";
"lng_send_folder" = "Impossible d'envoyer «{name}» car c'est un dossier :(";
"lng_send_images_selected#one" = "{count} image sélectionnée";
"lng_send_images_selected#other" = "{count} images sélectionnées";
"lng_send_photos#one" = "Envoyer {count} photo";
"lng_send_photos#other" = "Envoyer {count} photos";
"lng_send_files_selected#one" = "{count} fichier sélectionné";
"lng_send_files_selected#other" = "{count} fichier sélectionnés";
"lng_send_files#one" = "Envoyer {count} fichier";
"lng_send_files#other" = "Envoyer {count} fichiers";

"lng_forward_choose" = "Choose recipient...";
"lng_forward_cant" = "Sorry, no way to forward here :(";
"lng_forward_confirm" = "Forward to {recipient}?";
"lng_forward_share_contact" = "Share contact to {recipient}?";
"lng_forward_share_cant" = "Sorry, no way to share contact here :(";
"lng_forward_send_file_confirm" = "Send «{name}» to {recipient}?";
"lng_forward_send_files_confirm" = "Send selected files to {recipient}?";
"lng_forward_send_files_cant" = "Sorry, no way to send media here :(";
"lng_forward_send" = "Send";
"lng_forward_messages#one" = "{count} forwarded message";
"lng_forward_messages#other" = "{count} forwarded messages";
"lng_forwarding_from#one" = "{user} and {count} other";
"lng_forwarding_from#other" = "{user} and {count} others";
"lng_forwarding_from_two" = "{user} and {second_user}";
"lng_inline_switch_choose" = "Choose conversation...";
"lng_inline_switch_cant" = "Sorry, no way to write here :(";

"lng_share_cant" = "Sorry, no way to share here :(";
"lng_reply_cant" = "Sorry, no way to reply to an old message in supergroup :(";
"lng_reply_cant_forward" = "Sorry, no way to reply to an old message in supergroup :( Do you wish to forward it and add your comment?";

"lng_share_title" = "Share to";
"lng_share_copy_link" = "Copy share link";
"lng_share_confirm" = "Send";
"lng_share_wrong_user" = "This game was opened from a different user.";
"lng_share_game_link_copied" = "Game link copied to clipboard.";
"lng_share_done" = "Done!";

"lng_contact_phone" = "Phone number";
"lng_enter_contact_data" = "New Contact";
"lng_edit_group_title" = "Edit group name";
"lng_edit_contact_title" = "Edit contact name";
"lng_edit_channel_title" = "Edit channel";
"lng_edit_sign_messages" = "Sign messages";
"lng_edit_group_who_invites" = "Who can add members";
"lng_edit_group_invites_everybody" = "All members";
"lng_edit_group_invites_only_admins" = "Only admins";
"lng_edit_group" = "Edit group";
"lng_edit_self_title" = "Edit your name";
"lng_confirm_contact_data" = "New Contact";
"lng_add_contact" = "Create";
"lng_add_contact_button" = "New contact";
"lng_contacts_header" = "Contacts";
"lng_contact_not_joined" = "Unfortunately {name} did not join Telegram yet, but you can send your friend an invitation.\n\nWe will notify you about any of your contacts who is joining Telegram.";
"lng_try_other_contact" = "Try other";
"lng_create_group_link" = "Link";
"lng_create_group_invite_link" = "Invite link";
"lng_create_group_photo" = "Set Photo";
"lng_create_group_description" = "Description (optional)";

"lng_drag_images_here" = "Drop images here";
"lng_drag_photos_here" = "Drop photos here";
"lng_drag_files_here" = "Drop files here";

"lng_drag_to_send_quick" = "to send them in a quick way";
"lng_drag_to_send_no_compression" = "to send them without compression";
"lng_drag_to_send_files" = "to send them as files";

"lng_selected_clear" = "Annuler";
"lng_selected_delete" = "Supprimer";
"lng_selected_forward" = "Transférer";
"lng_selected_count#one" = "{count} message";
"lng_selected_count#other" = "{count} messages";
"lng_selected_cancel_sure_this" = "Cancel uploading?";
"lng_selected_upload_stop" = "Stop";
"lng_selected_delete_sure_this" = "Do you want to delete this message?";
"lng_selected_delete_sure#one" = "Do you want to delete {count} message?";
"lng_selected_delete_sure#other" = "Do you want to delete {count} messages?";
"lng_delete_photo_sure" = "Do you want to delete this photo?";
"lng_delete_for_everyone_hint#one" = "This will delete it for everyone in this chat.";
"lng_delete_for_everyone_hint#other" = "This will delete them for everyone in this chat.";
"lng_delete_for_me_chat_hint#one" = "This will delete it just for you, not for other participants of the chat.";
"lng_delete_for_me_chat_hint#other" = "This will delete them just for you, not for other participants of the chat.";
"lng_delete_for_me_hint#one" = "This will delete it just for you.";
"lng_delete_for_me_hint#other" = "This will delete them just for you.";
"lng_delete_for_everyone_check" = "Delete for everyone";
"lng_delete_for_other_check" = "Delete for {user}";
"lng_box_delete" = "Delete";
"lng_box_leave" = "Leave";

"lng_about_version" = "version {version}";
"lng_about_text_1" = "Official free messaging app based on [a href=\"https://core.telegram.org/api\"]Telegram API[/a]\nfor speed and security.";
"lng_about_text_2" = "This software is licensed under [a href=\"https://github.com/telegramdesktop/tdesktop/blob/master/LICENSE\"]GNU GPL[/a] version 3.\nSource code is available on [a href=\"https://github.com/telegramdesktop/tdesktop\"]GitHub[/a].";
"lng_about_text_3" = "Visit {faq_open}Telegram FAQ{faq_close} for more info.";
"lng_about_done" = "Done";

"lng_search_no_results" = "No messages found";
"lng_search_found_results#one" = "Found {count} message";
"lng_search_found_results#other" = "Found {count} messages";
"lng_search_global_results" = "Global search results";

"lng_media_save_progress" = "{ready} of {total} {mb}";
"lng_mediaview_save_as" = "Save As...";
"lng_mediaview_copy" = "Copy";
"lng_mediaview_forward" = "Forward";
"lng_mediaview_delete" = "Delete";
"lng_mediaview_photos_all" = "View all photos";
"lng_mediaview_files_all" = "View all files";
"lng_mediaview_single_photo" = "Single Photo";
"lng_mediaview_group_photo" = "Group Photo";
"lng_mediaview_channel_photo" = "Channel Photo";
"lng_mediaview_profile_photo" = "Profile Photo";
"lng_mediaview_file_n_of_count" = "{file} {n} of {count}";
"lng_mediaview_n_of_count" = "Photo {n} of {count}";
"lng_mediaview_doc_image" = "File";
"lng_mediaview_today" = "today at {time}";
"lng_mediaview_yesterday" = "yesterday at {time}";
"lng_mediaview_date_time" = "{date} at {time}";

"lng_mediaview_saved" = "Image was saved to your [c]Downloads[/c] folder";

"lng_theme_preview_title" = "Theme Preview";
"lng_theme_preview_generating" = "Generating color theme preview...";
"lng_theme_preview_invalid" = "Invalid data in this theme file.";
"lng_theme_preview_apply" = "Apply this theme";

"lng_new_authorization" = "{name},\nWe detected a login into your account from a new device on {day}, {date} at {time}\n\nDevice: {device}\nLocation: {location}\n\nIf this wasn't you, you can go to Settings — Show all sessions and terminate that session.\n\nIf you think that somebody logged in to your account against your will, you can enable two-step verification in Settings.\n\nSincerely,\nThe Telegram Team";

"lng_new_version_wrap" = "Telegram Desktop was updated to version {version}\n\n{changes}\n\nFull version history is available here:\n{link}";
"lng_new_version_minor" = "— Bug fixes and other minor improvements";
"lng_new_version_text" = "— Improved video messages: radial playback progress, Picture-in-Picture support, duration countdown.\n— Voice and video messages now automatically play one after another.";

"lng_menu_insert_unicode" = "Insert Unicode control character";

"lng_full_name" = "{first_name} {last_name}";

"lng_confirm_phone_link_invalid" = "This link is broken or has expired.";
"lng_confirm_phone_title" = "Cancel account reset";
"lng_confirm_phone_about" = "Somebody with access to your phone number {phone} has requested to delete your Telegram account and reset your 2-Step Verification password.\n\nIf this wasn't you, please enter the code we've just sent you via SMS to your number.";
"lng_confirm_phone_success" = "Success!\n\nThe deletion process was cancelled for your account {phone}. You may close this window now.";
"lng_confirm_phone_send" = "Send";
"lng_confirm_phone_enter_code" = "Please enter the code.";

"lng_theme_editor_no_keys" = "No keys in the palette yet";
"lng_theme_editor_cant_change_theme" = "You can not apply new themes while you're editing the color palette. Please close the theme editor first.";
"lng_theme_editor_new_keys" = "Not in the palette yet";
"lng_theme_editor_background_image" = "Background image";
"lng_theme_editor_saved_to_jpg" = "Saved to JPEG, {size}";
"lng_theme_editor_read_from_jpg" = "JPEG image, {size}";
"lng_theme_editor_read_from_png" = "PNG image, {size}";
"lng_theme_editor_export" = "Export";
"lng_theme_editor_choose_image" = "Choose background image";
"lng_theme_editor_save_palette" = "Save palette file";
"lng_theme_editor_choose_name" = "Save theme file";
"lng_theme_editor_error" = "The editor encountered an error :( See 'log.txt' for details.";
"lng_theme_editor_done" = "Theme exported successfully!";
"lng_theme_editor_title" = "Edit color palette";
"lng_theme_editor_export_button" = "Export theme";

"lng_payments_not_supported" = "Sorry, Telegram Desktop doesn't support payments yet. Please use one of our mobile apps to do this.";
"lng_payments_receipt_label" = "Receipt";
"lng_payments_receipt_label_test" = "Test receipt";
"lng_payments_invoice_label" = "Invoice";
"lng_payments_invoice_label_test" = "Test invoice";
"lng_payments_receipt_button" = "Receipt";

"lng_call_status_incoming" = "is calling you...";
"lng_call_status_connecting" = "connecting...";
"lng_call_status_exchanging" = "exchanging encryption keys...";
"lng_call_status_waiting" = "waiting...";
"lng_call_status_requesting" = "requesting...";
"lng_call_status_hanging" = "hanging up...";
"lng_call_status_ended" = "call ended";
"lng_call_status_failed" = "failed to connect";
"lng_call_status_ringing" = "ringing...";
"lng_call_status_busy" = "line busy";
"lng_call_fingerprint_tooltip" = "If emoji on {user}'s screen are the same, this call is 100% secure";

"lng_call_error_not_available" = "Sorry, {user} doesn't accept calls.";
"lng_call_error_incompatible" = "{user}'s app is using an incompatible protocol. They need to update their app before you can call them.";
"lng_call_error_outdated" = "{user}'s app does not support calls. They need to update their app before you can call them.";
"lng_call_error_audio_io" = "There seems to be a problem with audio playback on your computer. Please make sure that your computer's speakers and microphone are working and try again.";

"lng_call_bar_hangup" = "End call";

"lng_call_box_title" = "Calls";
"lng_call_box_about" = "You didn't make any calls yet.";
"lng_call_box_status_today" = "{time}";
"lng_call_box_status_yesterday" = "Yesterday at {time}";
"lng_call_box_status_date" = "{date} at {time}";
"lng_call_box_status_group" = "({count}) {status}";

"lng_call_outgoing" = "Outgoing call";
"lng_call_incoming" = "Incoming call";
"lng_call_missed" = "Missed call";
"lng_call_cancelled" = "Cancelled call";
"lng_call_declined" = "Declined call";
"lng_call_duration_info" = "{time}, {duration}";
"lng_call_type_and_duration" = "{type} ({duration})";

"lng_call_rate_label" = "Please rate the quality of your call";
"lng_call_rate_comment" = "Comment (optional)";

"lng_player_message_today" = "Today at {time}";
"lng_player_message_yesterday" = "Yesterday at {time}";
"lng_player_message_date" = "{date} at {time}";

"lng_rights_edit_admin" = "Edit administrator";
"lng_rights_edit_admin_header" = "What can this admin do?";
"lng_rights_about_add_admins_yes" = "This admin will be able to add new admins with the same (or more limited) permissions.";
"lng_rights_about_add_admins_no" = "This admin will not be able to add new admins.";
"lng_rights_user_restrictions" = "User restrictions";
"lng_rights_user_restrictions_header" = "What can this user do?";

"lng_rights_channel_info" = "Change channel info";
"lng_rights_channel_post" = "Post messages";
"lng_rights_channel_edit" = "Edit messages of others";
"lng_rights_channel_delete" = "Delete messages of others";
"lng_rights_group_info" = "Change group info";
"lng_rights_group_ban" = "Ban users";
"lng_rights_group_invite_link" = "Invite users via link";
"lng_rights_group_invite" = "Add users";
"lng_rights_group_pin" = "Pin messages";
"lng_rights_group_delete" = "Delete messages";
"lng_rights_add_admins" = "Add new admins";
"lng_rights_chat_read" = "Read messages";
"lng_rights_chat_send_text" = "Send messages";
"lng_rights_chat_send_media" = "Send media";
"lng_rights_chat_send_stickers" = "Send stickers & GIFs";
"lng_rights_chat_send_links" = "Embed links";
"lng_rights_chat_banned_until" = "Restricted until: {when}";
"lng_rights_chat_banned_forever" = "Forever";
"lng_rights_chat_banned_block" = "Ban and remove from group";

"lng_restricted_send_message" = "The admins of this group restricted you from writing here.";
"lng_restricted_send_media" = "The admins of this group restricted you from posting media content here.";
"lng_restricted_send_stickers" = "The admins of this group restricted you from posting stickers here.";
"lng_restricted_send_gifs" = "The admins of this group restricted you from posting GIFs here.";
"lng_restricted_send_inline" = "The admins of this group restricted you from posting inline content here.";

"lng_restricted_list_title" = "Restricted users";
"lng_banned_list_title" = "Banned users";

"lng_admin_log_title_all" = "All actions";
"lng_admin_log_title_selected" = "Selected actions";
"lng_admin_log_filter" = "Filter";
"lng_admin_log_filter_title" = "Filter";
"lng_admin_log_filter_all_actions" = "All actions";
"lng_admin_log_filter_restrictions" = "New restrictions";
"lng_admin_log_filter_admins_new" = "New admins";
"lng_admin_log_filter_members_new" = "New members";
"lng_admin_log_filter_info_group" = "Group info";
"lng_admin_log_filter_info_channel" = "Channel info";
"lng_admin_log_filter_messages_deleted" = "Deleted messages";
"lng_admin_log_filter_messages_edited" = "Edited messages";
"lng_admin_log_filter_messages_pinned" = "Pinned messages";
"lng_admin_log_filter_members_removed" = "Members removed";
"lng_admin_log_filter_all_admins" = "All admins";
"lng_admin_log_about" = "What is this?";
"lng_admin_log_about_text" = "This is a list of all service actions taken by the group's members and admins in the last 48 hours.";
"lng_admin_log_no_results_title" = "No events found";
"lng_admin_log_no_results_text" = "No recent events that match your query have been found.";
"lng_admin_log_no_events_title" = "No events yet";
"lng_admin_log_no_events_text" = "There were no service actions\ntaken by the group's members\nand admins in the last 48 hours.";

"lng_admin_log_empty_text" = "Empty";
"lng_admin_log_changed_title_group" = "{from} changed group name to «{title}»";
"lng_admin_log_changed_title_channel" = "{from} changed channel name to «{title}»";
"lng_admin_log_changed_description_group" = "{from} edited group description:";
"lng_admin_log_removed_description_group" = "{from} removed group description";
"lng_admin_log_changed_description_channel" = "{from} edited channel description:";
"lng_admin_log_removed_description_channel" = "{from} removed channel description";
"lng_admin_log_previous_description" = "Previous description";
"lng_admin_log_changed_link_group" = "{from} changed group link:";
"lng_admin_log_removed_link_group" = "{from} removed group link";
"lng_admin_log_changed_link_channel" = "{from} changed channel link:";
"lng_admin_log_removed_link_channel" = "{from} removed channel link";
"lng_admin_log_previous_link" = "Previous link";
"lng_admin_log_changed_photo_group" = "{from} changed group photo";
"lng_admin_log_changed_photo_channel" = "{from} changed channel photo";
"lng_admin_log_removed_photo_group" = "{from} removed group photo";
"lng_admin_log_removed_photo_channel" = "{from} removed channel photo";
"lng_admin_log_invites_enabled" = "{from} enabled group invites";
"lng_admin_log_invites_disabled" = "{from} disabled group invites";
"lng_admin_log_signatures_enabled" = "{from} enabled signatures";
"lng_admin_log_signatures_disabled" = "{from} disabled signatures";
"lng_admin_log_pinned_message" = "{from} pinned message:";
"lng_admin_log_unpinned_message" = "{from} unpinned message";
"lng_admin_log_edited_caption" = "{from} edited caption:";
"lng_admin_log_removed_caption" = "{from} removed caption";
"lng_admin_log_previous_caption" = "Original caption";
"lng_admin_log_edited_message" = "{from} edited message:";
"lng_admin_log_previous_message" = "Original message";
"lng_admin_log_deleted_message" = "{from} deleted message:";
"lng_admin_log_participant_joined" = "{from} joined the group";
"lng_admin_log_participant_left" = "{from} left the group";
"lng_admin_log_invited" = "invited {user}";
"lng_admin_log_banned" = "banned {user}";
"lng_admin_log_restricted" = "changed restrictions for {user} {until}";
"lng_admin_log_promoted" = "changed privileges for {user}";
"lng_admin_log_user_with_username" = "{name} ({mention})";
"lng_admin_log_restricted_forever" = "indefinitely";
"lng_admin_log_restricted_until" = "until {date}";
"lng_admin_log_banned_view_messages" = "Read messages";
"lng_admin_log_banned_send_messages" = "Send messages";
"lng_admin_log_banned_send_media" = "Send media";
"lng_admin_log_banned_send_stickers" = "Send stickers & GIFs";
"lng_admin_log_banned_embed_links" = "Embed links";
"lng_admin_log_admin_change_info" = "Change info";
"lng_admin_log_admin_post_messages" = "Post messages";
"lng_admin_log_admin_edit_messages" = "Edit messages";
"lng_admin_log_admin_delete_messages" = "Delete messages";
"lng_admin_log_admin_ban_users" = "Ban users";
"lng_admin_log_admin_invite_users" = "Add users";
"lng_admin_log_admin_invite_link" = "Invite users via link";
"lng_admin_log_admin_pin_messages" = "Pin messages";
"lng_admin_log_admin_add_admins" = "Add new admins";

// Not used

"lng_topbar_info" = "Info";
"lng_profile_group_info" = "Group info";
"lng_profile_channel_info" = "Channel info";

// Wnd specific

"lng_wnd_choose_program_menu" = "Choose Default Program...";

"lng_wnd_menu_undo" = "Undo";
"lng_wnd_menu_redo" = "Redo";

// Linux specific

"lng_linux_menu_undo" = "Undo";
"lng_linux_menu_redo" = "Redo";

// Mac specific

"lng_mac_choose_program_menu" = "Other...";

"lng_mac_choose_app" = "Choose Application";
"lng_mac_choose_text" = "Choose an application to open the document \"{file}\".";
"lng_mac_enable_filter" = "Enable:";
"lng_mac_recommended_apps" = "Recommended Applications";
"lng_mac_all_apps" = "All Applications";
"lng_mac_always_open_with" = "Always Open With";
"lng_mac_this_app_can_open" = "This application can open \"{file}\".";
"lng_mac_not_known_app" = "It's not known if this application can open \"{file}\".";

"lng_mac_menu_services" = "Services";
"lng_mac_menu_hide_telegram" = "Masquer {telegram}";
"lng_mac_menu_hide_others" = "Masquer les autres";
"lng_mac_menu_show_all" = "Tout afficher";
"lng_mac_menu_preferences" = "Préférences...";
"lng_mac_menu_quit_telegram" = "Quitter {telegram}";
"lng_mac_menu_about_telegram" = "À propos de {telegram}";
"lng_mac_menu_file" = "Fichier";
"lng_mac_menu_logout" = "Déconnexion";
"lng_mac_menu_edit" = "Édition";
"lng_mac_menu_undo" = "Annuler";
"lng_mac_menu_redo" = "Rétablir";
"lng_mac_menu_cut" = "Couper";
"lng_mac_menu_copy" = "Copier";
"lng_mac_menu_paste" = "Coller";
"lng_mac_menu_delete" = "Supprimer";
"lng_mac_menu_select_all" = "Tout sélectionner";
"lng_mac_menu_window" = "Fenêtre";
"lng_mac_menu_contacts" = "Contacts";
"lng_mac_menu_add_contact" = "Ajouter un contact";
"lng_mac_menu_new_group" = "Nouveau groupe";
"lng_mac_menu_new_channel" = "Nouvelle chaîne";
"lng_mac_menu_show" = "Afficher Telegram";

// Keys finished
